#!/bin/bash

set -e

RED="\e[31m"
GREEN="\e[32m"
YELLOW="\e[33m"
CYAN="\e[36m"
RESET="\e[0m"

clear

cat << "EOF"

 ███████╗██████╗ ██╗  ██╗ ██████╗ ███████╗████████╗
 ██╔════╝██╔══██╗██║  ██║██╔═══██╗██╔════╝╚══██╔══╝
 ███████╗██████╔╝███████║██║   ██║███████╗   ██║
 ╚════██║██╔══██╗██╔══██║██║   ██║╚════██║   ██║
 ███████║██████╔╝██║  ██║╚██████╔╝███████║   ██║
 ╚══════╝╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝

        SBHOST Minecraft Installer
              Version 1.0

EOF

sleep 2

if [ "$EUID" -ne 0 ]; then
    echo -e "${RED}Please run as root.${RESET}"
    exit 1
fi

echo -e "${YELLOW}Updating system...${RESET}"
apt update -y
apt install -y curl wget screen unzip openjdk-21-jre-headless

echo -e "${GREEN}Dependencies Installed Successfully.${RESET}"
sleep 1
